rainrainrainbow/epsilon-xiaomiao/sdkconfig.defaults
# ESP32-WROVER-B: 16MB Flash, 8MB PSRAM (4MB mapped to heap)
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# PSRAM (WROVER-B has octal PSRAM via quad bus on ESP32)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# Frequency
CONFIG_ESP32_DEFAULT_CPU_FREQ_240=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Partition table (factory + OTA for xiaomiao-loader compatibility)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Compiler optimizations
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Console / logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Stack size for main task (UI needs more)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# Disable WiFi/BT to reduce IRAM usage (not needed for calculator)
CONFIG_BT_ENABLED=n
